In [7]:
import pandas as pd
import numpy as np

In [8]:
# csv file load without col names
titanic_data_df = pd.read_csv("C:/Users/tewat/DataSciense/kaggleData/train.csv")

In [9]:
titanic_data_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
titanic_data_df.columns[titanic_data_df.isnull().values.any()].tolist()

[['PassengerId',
  'Survived',
  'Pclass',
  'Name',
  'Sex',
  'Age',
  'SibSp',
  'Parch',
  'Ticket',
  'Fare',
  'Cabin',
  'Embarked']]

In [12]:
len(titanic_data_df)

891

In [11]:
titanic_data_df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [16]:
len(titanic_data_df['Cabin'].unique())

148

In [17]:
titanic_data_df=titanic_data_df.dropna(how='any')

In [18]:
len(titanic_data_df['Cabin'].unique())

133

In [22]:
titanic_df_age = titanic_data_df.dropna(subset=['Age'])

In [23]:
len(titanic_df_age)

183

In [53]:
new_data = {'f_Name':['Anuj', 'Anu', 'Amit', 'Anuj'],
                         'l_Name':['Tewatia', 'chopra', 'Tewatia', 'Tewatia'],
                         'prog_lang':['Java', 'Python', 'Ruby', 'Java'],
                         'grade_Marks':['A', 'B', 'C', 'A'],
                         'test_Score': [4, 4, 31, 4]}

In [54]:
new_data['f_Name']

['Anuj', 'Anu', 'Amit', 'Anuj']

In [55]:
type(new_data)

dict

In [56]:
# creating a dataframe with column name

data_f = pd.DataFrame(new_data, columns = ['f_Name', 'l_Name', 'prog_lang', 'grade_Marks', 'test_Score'])

In [57]:
data_f.head()

  f_Name   l_Name prog_lang grade_Marks  test_Score
0   Anuj  Tewatia      Java           A           4
1    Anu   chopra    Python           B           4
2   Amit  Tewatia      Ruby           C          31
3   Anuj  Tewatia      Java           A           4

In [58]:
# creating another column by joining first and last name

data_f['full_name'] = data_f['f_Name'] + ' ' + data_f['l_Name']

In [59]:
data_f

  f_Name   l_Name prog_lang grade_Marks  test_Score     full_name
0   Anuj  Tewatia      Java           A           4  Anuj Tewatia
1    Anu   chopra    Python           B           4    Anu chopra
2   Amit  Tewatia      Ruby           C          31  Amit Tewatia
3   Anuj  Tewatia      Java           A           4  Anuj Tewatia

In [60]:
data_f.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [69]:
# dropping the duplicate
data_f.drop_duplicates(inplace=True)

In [63]:
data_f

  f_Name   l_Name prog_lang grade_Marks  test_Score     full_name
0   Anuj  Tewatia      Java           A           4  Anuj Tewatia
1    Anu   chopra    Python           B           4    Anu chopra
2   Amit  Tewatia      Ruby           C          31  Amit Tewatia

In [70]:
#creating the indexes for the rows
data_f = pd.DataFrame(new_data, index = ['Student1', 'Student2', 'Student3', 'Student4'])

In [81]:
data_f

         f_Name grade_Marks   l_Name prog_lang  test_Score
Student1   Anuj           A  Tewatia      Java           4
Student2    Anu           B   chopra    Python           4
Student3   Amit           C  Tewatia      Ruby          31
Student4   Anuj           A  Tewatia      Java           4

In [78]:
data_f.drop('test_Score', axis=1)

         f_Name grade_Marks   l_Name prog_lang
Student1   Anuj           A  Tewatia      Java
Student2    Anu           B   chopra    Python
Student3   Amit           C  Tewatia      Ruby
Student4   Anuj           A  Tewatia      Java

In [87]:
titanic_df1 = pd.DataFrame({'A': ['PassengerId0', 'PassengerId1', 'PassengerId2', 'PassengerId3'],
                        'B': ['Pclass0', 'Pclass01', 'Pclass02', 'Pclass03'],
                        'C': ['Embarked0', 'Embarked1', 'Embarked2', 'Embarked3'],
                        'D': ['Fare0', 'Fare1', 'Fare2', 'Fare3']},
                             index=[0, 1, 2, 3])

In [89]:
titanic_df1

              A         B          C      D
0  PassengerId0   Pclass0  Embarked0  Fare0
1  PassengerId1  Pclass01  Embarked1  Fare1
2  PassengerId2  Pclass02  Embarked2  Fare2
3  PassengerId3  Pclass03  Embarked3  Fare3

In [88]:
titanic_df2 = pd.DataFrame({'A': ['PassengerId4', 'PassengerId5', 'PassengerId6', 'PassengerId7'],
                        'B': ['Pclass4', 'Pclass5', 'Pclass6', 'Pclass7'],
                        'C': ['Embarked4', 'Embarked5', 'Embarked6', 'Embarked7'],
                        'D': ['Fare4', 'Fare5', 'Fare6', 'Fare7']},
                             index=[4,5,6,7])

In [90]:
titanic_df2

              A        B          C      D
4  PassengerId4  Pclass4  Embarked4  Fare4
5  PassengerId5  Pclass5  Embarked5  Fare5
6  PassengerId6  Pclass6  Embarked6  Fare6
7  PassengerId7  Pclass7  Embarked7  Fare7

In [98]:
titanic_df3 = pd.DataFrame({'A': ['PassengerId0', 'PassengerId9', 'PassengerId10', 'PassengerId11'],
                        'B': ['Pclass08', 'Pclass01', 'Pclass02', 'Pclass03'],
                        'C': ['Embarked0', 'Embarked9', 'Embarked10', 'Embarked3'],
                        'D': ['Fare08', 'Fare1', 'Fare2', 'Fare11']},
                             index=[8,9,10,11])

In [99]:
titanic_df3

                A         B           C       D
8    PassengerId0  Pclass08   Embarked0  Fare08
9    PassengerId9  Pclass01   Embarked9   Fare1
10  PassengerId10  Pclass02  Embarked10   Fare2
11  PassengerId11  Pclass03   Embarked3  Fare11

In [91]:
# creating the data frames
data_frames = [titanic_df1, titanic_df2]

In [93]:
combined_dframe = pd.concat(data_frames)

In [94]:
combined_dframe

              A         B          C      D
0  PassengerId0   Pclass0  Embarked0  Fare0
1  PassengerId1  Pclass01  Embarked1  Fare1
2  PassengerId2  Pclass02  Embarked2  Fare2
3  PassengerId3  Pclass03  Embarked3  Fare3
4  PassengerId4   Pclass4  Embarked4  Fare4
5  PassengerId5   Pclass5  Embarked5  Fare5
6  PassengerId6   Pclass6  Embarked6  Fare6
7  PassengerId7   Pclass7  Embarked7  Fare7

In [95]:
#combining the two dataframes along columns
pd.concat([titanic_df1, titanic_df2], axis=1)

,A,B,C,D,A,B,C,D
0,PassengerId0,Pclass0,Embarked0,Fare0,NaN,NaN,NaN,NaN
1,PassengerId1,Pclass01,Embarked1,Fare1,NaN,NaN,NaN,NaN
2,PassengerId2,Pclass02,Embarked2,Fare2,NaN,NaN,NaN,NaN
3,PassengerId3,Pclass03,Embarked3,Fare3,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,PassengerId4,Pclass4,Embarked4,Fare4
5,NaN,NaN,NaN,NaN,PassengerId5,Pclass5,Embarked5,Fare5
6,NaN,NaN,NaN,NaN,PassengerId6,Pclass6,Embarked6,Fare6
7,NaN,NaN,NaN,NaN,PassengerId7,Pclass7,Embarked7,Fare7

In [103]:
# Joining common elements from different dataframes
#outer join : for dataframe 1 and 3
pd.merge(titanic_df1, titanic_df3, how='outer')

               A         B           C       D
0   PassengerId0   Pclass0   Embarked0   Fare0
1   PassengerId1  Pclass01   Embarked1   Fare1
2   PassengerId2  Pclass02   Embarked2   Fare2
3   PassengerId3  Pclass03   Embarked3   Fare3
4   PassengerId0  Pclass08   Embarked0  Fare08
5   PassengerId9  Pclass01   Embarked9   Fare1
6  PassengerId10  Pclass02  Embarked10   Fare2
7  PassengerId11  Pclass03   Embarked3  Fare11

In [104]:
#Left Join
pd.merge(titanic_df1, titanic_df3, how='left')

              A         B          C      D
0  PassengerId0   Pclass0  Embarked0  Fare0
1  PassengerId1  Pclass01  Embarked1  Fare1
2  PassengerId2  Pclass02  Embarked2  Fare2
3  PassengerId3  Pclass03  Embarked3  Fare3